Revit 2027 API
BalusterPattern.RemoveBaluster Method
 Removes a baluster from the main baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveBaluster(
	int index
)
Public Sub RemoveBaluster (
	index As Integer
)
public:
void RemoveBaluster(
	int index
)
member RemoveBaluster :
        index : int -> unit
Parameters
index Int32
 Baluster index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index index is out of range.
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace